1s/ERP/Conf/AccumulationRegisters/Лико_СтоимостьДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Лико_СтоимостьДоставки</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>8</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРегл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>8</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

1s/ERP/Conf/AccumulationRegisters/Лико_СтоимостьДоставки/Ext/ManagerModule.bsl
Процедура Лико_РассчитатьСтоимостьДоставки(Объект) Экспорт // --> Начало Лико Ефимов ЕВВ 24.08.2018
	
	КурсДокумента = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Константы.ВалютаУправленческогоУчета.Получить(), ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДата())).Курс;
	ОбщийВесКоробок = Лико_РассчитатьОбщийВесКоробок(Объект);
	ОбщаяСтоимостьДоставкиВЕвро = ?(КурсДокумента = 0, 0, Объект.Лико_ОбщаяСтоимостьДоставки / КурсДокумента);
	СтоимостьДоставкиВЕвроЗаКг = ?(ОбщийВесКоробок = 0, 0, ОбщаяСтоимостьДоставкиВЕвро / ОбщийВесКоробок);
	
	Для каждого Строка из Объект.Товары Цикл
		Строка.Лико_СтоимостьДоставки = 0;
	КонецЦикла;
	Таблица = Объект.Товары.Выгрузить(, "НомерСтроки,Номенклатура,Количество");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Т.НомерСтроки КАК НомерСтроки,
		|	Т.Номенклатура КАК Номенклатура,
		|	Т.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&Таблица КАК Т
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
		|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
		|	ТаблицаТоваров.Количество * &ТекстЗапросаВесНоменклатуры * &СтоимостьЗаКг КАК Стоимость
		|ИЗ
		|	ВТ КАК ТаблицаТоваров";
	
	Запрос.Текст = СтрЗаменить(
		Запрос.Текст, 
		"&ТекстЗапросаВесНоменклатуры",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаВесУпаковки(
			"ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения",
			"ТаблицаТоваров.Номенклатура"));
		
	Запрос.УстановитьПараметр("Таблица", Таблица);
	Запрос.УстановитьПараметр("СтоимостьЗаКг", СтоимостьДоставкиВЕвроЗаКг);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Объект.Товары[ВыборкаДетальныеЗаписи.НомерСтроки-1].Лико_СтоимостьДоставки = ВыборкаДетальныеЗаписи.Стоимость;
	КонецЦикла;
	
КонецПроцедуры // <-- Конец Лико Ефимов ЕВВ 24.08.2018 

Функция Лико_РассчитатьОбщийВесКоробок(Объект) Экспорт // --> Начало Лико Ефимов ЕВВ 24.08.2018 
	
	Таблица = Объект.Товары.Выгрузить(, "Номенклатура,Количество");
	Если Таблица.Количество() = 0 Тогда
		Возврат 0;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Т.Номенклатура КАК Номенклатура,
		|	Т.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&Таблица КАК Т
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
		|	ТаблицаТоваров.Количество * &ТекстЗапросаВесНоменклатуры КАК Вес
		|ПОМЕСТИТЬ ВТ2
		|ИЗ
		|	ВТ КАК ТаблицаТоваров
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВТ2.Вес) КАК Вес
		|ИЗ
		|	ВТ2 КАК ВТ2";
	
	Запрос.Текст = СтрЗаменить(
		Запрос.Текст, 
		"&ТекстЗапросаВесНоменклатуры",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаВесУпаковки(
			"ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения",
			"ТаблицаТоваров.Номенклатура"));
		
	Запрос.УстановитьПараметр("Таблица", Таблица);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ОбщийВесКоробок = 0;
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ОбщийВесКоробок = ВыборкаДетальныеЗаписи.Вес;
	КонецЕсли;
	
	Возврат ОбщийВесКоробок;
		
КонецФункции // <-- Конец Лико Ефимов ЕВВ 24.08.2018 

// Если ВызовИзОбработкиПроведения = Ложь, то вместо объекта нужно передать ссылку
Процедура Лико_СформироватьДвиженияПоРНЛико_СтоимостьДоставки(Отказ, ОбъектСсылка, ВызовИзОбработкиПроведения = Истина) Экспорт // --> Начало Лико Ефимов ЕВВ 27.08.2018

	Если ВызовИзОбработкиПроведения Тогда
		ОбъектСсылка.Движения.Лико_СтоимостьДоставки.Записывать = Истина;
		ОбъектСсылка.Движения.Лико_СтоимостьДоставки.Очистить();
	Иначе  
		РН = РегистрыНакопления.Лико_СтоимостьДоставки.СоздатьНаборЗаписей();
		РН.Отбор.Регистратор.Установить(ОбъектСсылка.Ссылка);
		РН.Прочитать();
		РН.Очистить();
		РН.Записать();
	КонецЕсли;
	
	СкладДляРасчетаСтоимостиДоставки = ?(ЗначениеЗаполнено(ОбъектСсылка.Лико_СкладДляРасчетаСтоимостиДоставки), ОбъектСсылка.Лико_СкладДляРасчетаСтоимостиДоставки, ОбъектСсылка.Склад);
	Если Отказ ИЛИ ОбъектСсылка.Лико_ОбщаяСтоимостьДоставки = 0 ИЛИ НЕ ЗначениеЗаполнено(СкладДляРасчетаСтоимостиДоставки) ИЛИ СкладДляРасчетаСтоимостиДоставки.ИспользоватьОрдернуюСхемуПриОтгрузке Тогда
		Возврат;
	КонецЕсли;
	
	КурсДокумента = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Константы.ВалютаУправленческогоУчета.Получить(), ?(ЗначениеЗаполнено(ОбъектСсылка.Дата), ОбъектСсылка.Дата, ТекущаяДата())).Курс;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЧТовары.Ссылка.Дата КАК Период,
		|	ВЫБОР
		|		КОГДА ТЧТовары.Ссылка.Лико_СкладДляРасчетаСтоимостиДоставки = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
		|			ТОГДА ТЧТовары.Ссылка.Склад
		|		ИНАЧЕ ТЧТовары.Ссылка.Лико_СкладДляРасчетаСтоимостиДоставки
		|	КОНЕЦ КАК Склад,
		|	ТЧТовары.Характеристика.Лико_ЗаказНоменклатуры КАК Заказ,
		|	ТЧТовары.Номенклатура КАК Номенклатура,
		|	ТЧТовары.Характеристика КАК Характеристика,
		|	СУММА(ТЧТовары.Количество) КАК Количество,
		|	СУММА(ТЧТовары.Лико_СтоимостьДоставки) КАК Сумма,
		|	СУММА(ТЧТовары.Лико_СтоимостьДоставки * &Курс) КАК СуммаРегл
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК ТЧТовары
		|ГДЕ
		|	ТЧТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ТЧТовары.Характеристика.Лико_ЗаказНоменклатуры,
		|	ТЧТовары.Номенклатура,
		|	ТЧТовары.Характеристика,
		|	ТЧТовары.Ссылка.Дата,
		|	ВЫБОР
		|		КОГДА ТЧТовары.Ссылка.Лико_СкладДляРасчетаСтоимостиДоставки = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
		|			ТОГДА ТЧТовары.Ссылка.Склад
		|		ИНАЧЕ ТЧТовары.Ссылка.Лико_СкладДляРасчетаСтоимостиДоставки
		|	КОНЕЦ";
	
    Если ОбъектСсылка.Метаданные().Имя = "ОтгрузкаТоваровСХранения" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.РеализацияТоваровУслуг", "Документ.ОтгрузкаТоваровСХранения");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Курс", ?(ЗначениеЗаполнено(КурсДокумента), КурсДокумента, 1));
	Запрос.УстановитьПараметр("Ссылка", ОбъектСсылка.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВызовИзОбработкиПроведения Тогда
			ЗаполнитьЗначенияСвойств(ОбъектСсылка.Движения.Лико_СтоимостьДоставки.Добавить(), ВыборкаДетальныеЗаписи);
		Иначе
			ЗаполнитьЗначенияСвойств(РН.Добавить(), ВыборкаДетальныеЗаписи);
		КонецЕсли;
	КонецЦикла; 
	
	Если НЕ ВызовИзОбработкиПроведения Тогда
		РН.Записать();
	КонецЕсли;
	
КонецПроцедуры // <-- Конец Лико Ефимов ЕВВ 27.08.2018
